       identification division.
       program-id. module1.
       environment division.
       configuration section.
       repository.
           function all intrinsic.
       procedure division.
       main.
           display "module-id = " module-id.


